#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_client_config.provider: Reading...
module.gcr.google_project_service.api["containerregistry.googleapis.com"]: Refreshing state... [id=tbd-2023z-304098/containerregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2023z-304098/global/networks/main-vpc]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2023z-304098-code]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2023z-304098-data]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2023z-304098"/regions/"europe-west1"/zones/<null>]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2023z-304098-code-spark-job.py]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2023z-304098/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2023z-304098/regions/europe-west1/subnetworks/subnet-01]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2023z-304098/global/firewalls/default-internal-allow-all]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2023z-304098/regions/europe-west1/routers/nat-router]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2023z-304098/global/firewalls/allow-all-internal]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2023z-304098/europe-west1/nat-router/nat-gateway]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2023z-304098/global/routes/egress-internet]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2023z-304098/dataproc.googleapis.com]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2023z-304098/composer.googleapis.com]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2023z-304098/serviceAccounts/tbd-2023z-304098-data@tbd-2023z-304098.iam.gserviceaccount.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2023z-304098/regions/europe-west1/subnetworks/composer-subnet-01]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2023z-304098/roles/iam.serviceAccountUser/serviceAccount:tbd-2023z-304098-data@tbd-2023z-304098.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2023z-304098-code/roles/storage.objectViewer/serviceAccount:tbd-2023z-304098-data@tbd-2023z-304098.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2023z-304098-data/roles/storage.objectUser/serviceAccount:tbd-2023z-304098-data@tbd-2023z-304098.iam.gserviceaccount.com]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2023z-304098/roles/composer.worker/serviceAccount:tbd-2023z-304098-data@tbd-2023z-304098.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2023z-304098/roles/dataproc.editor/serviceAccount:tbd-2023z-304098-data@tbd-2023z-304098.iam.gserviceaccount.com]
module.gcr.google_container_registry.registry: Refreshing state... [id=eu.artifacts.tbd-2023z-304098.appspot.com]
module.composer.module.composer.data.google_project.project: Reading...
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2023z-304098/regions/europe-west1/clusters/tbd-cluster]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:717ba68d8b41a6db37ab25caea5ad92510510761f32ef7053650d5b10f4f1e45eu.gcr.io/tbd-2023z-304098/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:4402dc313885615f2176b64f0de5e5c788e6a4b475821d14c69908cba6cfc80b]
module.composer.module.composer.data.google_project.project: Read complete after 1s [id=projects/tbd-2023z-304098]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2023z-304098/roles/composer.ServiceAgentV2Ext/serviceAccount:service-519557031031@cloudcomposer-accounts.iam.gserviceaccount.com]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2023z-304098/notebooks.googleapis.com]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2023z-304098/roles/iam.serviceAccountTokenCreator]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2023z-304098-conf]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2023z-304098-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2023z-304098-conf-scripts/notebook_post_startup_script.sh]
module.composer.module.composer.google_composer_environment.composer_env: Refreshing state... [id=projects/tbd-2023z-304098/locations/europe-west1/environments/demo-lab]
data.google_container_cluster.composer-gke-cluster: Reading...
module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-4174f50b-bucket-dags/data-dag.py]
module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-4174f50b-bucket-dags/dbt-dag.py]
module.dbt_docker_image.docker_image.dbt: Refreshing state... [id=sha256:f0600e959ba07a7b9422c9b820c9900437bb3ce09e4e11c3fd172e11c109ed97eu.gcr.io/tbd-2023z-304098/dbt:1.7.3]
module.dbt_docker_image.docker_registry_image.dbt: Refreshing state... [id=sha256:99f77a547fe42ba1878b7c3c04bb2a9cd4fede7e91a529fc3997c9993f57d4e5]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2023z-304098/locations/europe-west1-b/instances/tbd-2023z-304098-notebook]
data.google_container_cluster.composer-gke-cluster: Read complete after 3s [id=projects/tbd-2023z-304098/locations/europe-west1/clusters/europe-west1-demo-lab-4174f50b-gke]
kubernetes_service.dbt-task-service: Refreshing state... [id=composer-user-workloads/dbt-task-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.dbt_docker_image.docker_image.dbt has been deleted
  - resource "docker_image" "dbt" {
        id       = "sha256:f0600e959ba07a7b9422c9b820c9900437bb3ce09e4e11c3fd172e11c109ed97eu.gcr.io/tbd-2023z-304098/dbt:1.7.3"
      - name     = "eu.gcr.io/tbd-2023z-304098/dbt:1.7.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id       = "sha256:717ba68d8b41a6db37ab25caea5ad92510510761f32ef7053650d5b10f4f1e45eu.gcr.io/tbd-2023z-304098/jupyter:3.6.3"
      - name     = "eu.gcr.io/tbd-2023z-304098/jupyter:3.6.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # kubernetes_service.dbt-task-service will be updated in-place
  ~ resource "kubernetes_service" "dbt-task-service" {
        id                     = "composer-user-workloads/dbt-task-service"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cloud.google.com/neg" = jsonencode(
                    {
                      - ingress = true
                    }
                ) -> null
            }
            name             = "dbt-task-service"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2023z-304098/dbt:1.7.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION" = "1.7.1"
              + "DBT_VERSION"       = "1.7.3"
              + "PROJECT_NAME"      = "tbd-2023z-304098"
              + "SPARK_VERSION"     = "3.3.2"
            }
          + cache_from   = []
          + context      = ".terraform/modules/dbt_docker_image/modules/dbt_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2023z-304098/dbt:latest",
            ]
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2023z-304098/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.3"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "3.6.3"
              + "PROJECT_NAME"          = "tbd-2023z-304098"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from   = []
          + context      = ".terraform/modules/jupyter_docker_image/modules/jupyter_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2023z-304098/jupyter:latest",
            ]
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2023z-304098"
      + skip_delete         = (known after apply)
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2023z-304098/roles/iam.serviceAccountTokenCreator"
      ~ members = [
          - "serviceAccount:519557031031-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2023z-304098-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:519557031031-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.composer.module.composer.google_composer_environment.composer_env will be updated in-place
  ~ resource "google_composer_environment" "composer_env" {
        id      = "projects/tbd-2023z-304098/locations/europe-west1/environments/demo-lab"
        name    = "demo-lab"
        # (3 unchanged attributes hidden)

      ~ config {
            # (6 unchanged attributes hidden)

          ~ software_config {
              ~ env_variables            = {
                  ~ "AIRFLOW_VAR_DBT_GIT_REPO"        = "https://github.com/mwiewior/tbd-tpc-di.git" -> "https://github.com/thai-chicken/tbd-tpc-di.git"
                    # (6 unchanged elements hidden)
                }
                # (4 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (7 unchanged blocks hidden)
        }
    }

Plan: 2 to add, 4 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Mateuszeqq, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*